InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_НомерТелефонаТолькоЦифры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.омг_СторонниеВрачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПроцентыВознагражденийАгентам_ЕИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ПроцентыВознагражденийАгентам_ЕИП</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_РезультатыОбменаССервисами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_РезультатыОбменаССервисами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияНакопленийПоКартеЕИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияНакопленийПоКартеЕИП</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КартаСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_СоответствиеСкидокВидамКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_СоответствиеСкидокВидамКарт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКартСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДействиеСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДействиеСкидок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>удалитьДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КартыСкидок</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКартСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_ДокументыНачисленийНаКартыЕИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_ДокументыНачисленийНаКартыЕИП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ИнтеграцияЕИП/Ext/Module.bsl
#Область ОсновныеФункции
 
Функция ПоискКартыПоИИН(ИИН = "") Экспорт
	
	СтруктураОтвета = Новый Структура();
	СтруктураОтвета.Вставить("ОтветПустой", Истина);
	СтруктураОтвета.Вставить("Фамилия",);
	СтруктураОтвета.Вставить("Имя",);
	СтруктураОтвета.Вставить("Отчество",);
	СтруктураОтвета.Вставить("ИИН",);
	СтруктураОтвета.Вставить("id",);
	СтруктураОтвета.Вставить("Адрес",);
	СтруктураОтвета.Вставить("ДатаРождения",);
	СтруктураОтвета.Вставить("КодСкидкиЕИП",);
	СтруктураОтвета.Вставить("ЗначениеСкидкиЕИП",);
	СтруктураОтвета.Вставить("Сумма",);
	СтруктураОтвета.Вставить("ВидСкидки",);
	СтруктураОтвета.Вставить("Телефон",);    
	СтруктураОтвета.Вставить("НомерКарты",);
	
	Если НЕ (ЗначениеЗаполнено(ИИН) И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИИН)) Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
			
	Ответ = ВызватьСерверЕИП(ПолучитьТекстЗапросаПоискаПоИИН(ИИН, КодЛаборатории()), 5);
	
	Если Ответ = Неопределено Тогда
		СтруктураОтвета.Вставить("Ошибка");
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	Если НЕ Ответ.КодСостояния = 200 Тогда
		СтруктураОтвета.Вставить("Ошибка");
		Возврат СтруктураОтвета;
	КонецЕсли; 
	
	ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	//читаем xml в переменную
	ОтветXML = Новый ЧтениеXML();
	ОтветXML.УстановитьСтроку(ОтветСтрокой);
	
	//десериализуем текст в объект с помощью фабрики
	Объектxdto = ДесериализоватьОтветЧерезФабрику("ИнтеграцияЕИП_ОтветПоискКартыПоИИН",ОтветXML);
	
	Свойства = Объектxdto.MethodResponse.Свойства();
	
	Если НЕ Свойства.Получить("Error") = Неопределено Тогда
		ЗаписьЖурналаРегистрации("Получение данных с ЕИП по ИИН", УровеньЖурналаРегистрации.Ошибка,,,Объектxdto.MethodResponse.Error.Message,РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	Если НЕ Свойства.Получить("Result") = Неопределено  
		И НЕ Объектxdto.MethodResponse.Result.Свойства().Получить("iin") = Неопределено
		И НЕ Объектxdto.MethodResponse.Result.iin.Свойства().Получить("lastName") = Неопределено Тогда
		//данные есть, заполняем 
		
		СвойстваИИН = Объектxdto.MethodResponse.Result.iin.Свойства();
		
		СтруктураОтвета.Фамилия = Объектxdto.MethodResponse.Result.iin.LastName;
		СтруктураОтвета.ОтветПустой = Ложь;
		СтруктураОтвета.Имя = Объектxdto.MethodResponse.Result.iin.FirstName;
		Если Не СвойстваИИН.Получить("MiddleName") = Неопределено Тогда
			СтруктураОтвета.Отчество = Объектxdto.MethodResponse.Result.iin.MiddleName;
		КонецЕсли;
		СтруктураОтвета.ИИН = Объектxdto.MethodResponse.Result.iin.Iin;
		Если НЕ СвойстваИИН.Получить("Id") = Неопределено Тогда
			СтруктураОтвета.Id = Объектxdto.MethodResponse.Result.iin.Id;
		КонецЕсли;
		
		Если НЕ Объектxdto.MethodResponse.Result.Свойства().Получить("card") = Неопределено
			И НЕ Объектxdto.MethodResponse.Result.card.Свойства().Получить("DiscountCode") = Неопределено Тогда
			
			Если Не Объектxdto.MethodResponse.Result.card.Свойства().Получить("Address") = Неопределено Тогда
				СтруктураОтвета.Адрес = Объектxdto.MethodResponse.Result.card.Address;
			Иначе 
				СтруктураОтвета.Адрес = "";
			КонецЕсли;
			СтруктураОтвета.НомерКарты = Объектxdto.MethodResponse.Result.Card.Nr;
			СтруктураОтвета.ДатаРождения = Объектxdto.MethodResponse.Result.card.BirthDate;
			СтруктураОтвета.КодСкидкиЕИП = Объектxdto.MethodResponse.Result.card.DiscountCode;    
			Попытка
				СтруктураОтвета.Сумма = Число(Объектxdto.MethodResponse.Result.card.TotalMoney) / 100;
			Исключение
			КонецПопытки;
			СтруктураОтвета.ЗначениеСкидкиЕИП = Объектxdto.MethodResponse.Result.card.DiscountValue;
			СтруктураОтвета.ВидСкидки = Справочники.ВидыСкидок.НайтиПоРеквизиту("КодЕИП", Объектxdto.MethodResponse.Result.card.DiscountCode);
			Если Не Объектxdto.MethodResponse.Result.card.Свойства().Получить("MobilePhone") = Неопределено Тогда 
				СтруктураОтвета.Телефон = Объектxdto.MethodResponse.Result.card.MobilePhone; 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Процедура ЗагрузитьВрачейИзЕИП() Экспорт
	
	TimeStamp = Константы.ПоследнийTimeStampЕИП.Получить();
	Если НЕ ЗначениеЗаполнено(TimeStamp) Тогда
		TimeStamp = "0";
	КонецЕсли;
	
	Ответ = ВызватьСерверЕИП(ПолучитьТекстЗапросаДляЗагрузкиВрачей(TimeStamp));
	Если Ответ = Неопределено Тогда
		Возврат ;
	КонецЕсли;
	
	Если НЕ Ответ.КодСостояния = 200 Тогда
		Возврат ;
	КонецЕсли; 
	
	ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку("UTF-8"); //windows-1251
	
	//читаем xml в переменную
	ОтветXML = Новый ЧтениеXML();
	ОтветXML.УстановитьСтроку(ОтветСтрокой);
	
	//десериализуем текст в объект с помощью фабрики
	Объектxdto = ДесериализоватьОтветЧерезФабрику("ИнтеграцияЕИП_ОтветЗагрузкаВрачей",ОтветXML);	

	//<Result> 
	//  <Item  
	//    MiddleName="ХАУЕЗХАНОВНА"  
	//    FirstName="ГАЛИЯ"  
	//    BirthDate="02.01.1980 00:00:00"  
	//    LastName="СЫЗДЫКОВА"  
	//    Gender="2"  
	//    Comment=""  
	//    Code="300135"  
	//    MobilePhone="777 1111111"  
	//    Removed="false"  
	//    LabCode="4"  
	//    Email=""  
	//    Timestamp="51290"  
	//    HomePhone=""/> 
	// </Result> 
	//</MethodResponse>  
	
	ЗагруженоВрачей = 0;
	
	Если НЕ Объектxdto.MethodResponse.Свойства().Получить("Result") = Неопределено  
		И НЕ Объектxdto.MethodResponse.Result.Свойства().Получить("Item") = Неопределено Тогда
		
		Родитель = Справочники.Контрагенты.НайтиПоКоду("000000002"); //внешние агенты
		ПоследнийTimeStamp = TimeStamp;	
		Для Каждого ЭлементМассивВрач Из Объектxdto.MethodResponse.Result.item Цикл
			
			Если Число(ПоследнийTimeStamp) < Число(ЭлементМассивВрач.Timestamp) Тогда
				ПоследнийTimeStamp = ЭлементМассивВрач.Timestamp;
			КонецЕсли;
			
			Свойства = ЭлементМассивВрач.Свойства();
			
			//сначала ищем врача
			Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодАгента", ЭлементМассивВрач.Code);
			//нашли, ничего пока не делаем
			Если ЗначениеЗаполнено(Контрагент) Тогда
				Продолжить;
			КонецЕсли;
			
			////надо ли записывать удаленных?
			//Если ЭлементМассивВрач.Removed = "true" Тогда
			//	Продолжить;
			//КонецЕсли;
			
			//не нашли, создадим новый
			Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
			Контрагент.Родитель = Родитель;
			Если НЕ Свойства.Получить("LastName") = Неопределено Тогда
				Контрагент.Наименование = ЭлементМассивВрач.LastName;
			КонецЕсли;
			Если НЕ Свойства.Получить("FirstName") = Неопределено Тогда
				Контрагент.Наименование = Контрагент.Наименование + " " + ЭлементМассивВрач.FirstName;
			КонецЕсли;
			Если НЕ Свойства.Получить("MiddleName") = Неопределено Тогда
				Контрагент.Наименование = Контрагент.Наименование + " " + ЭлементМассивВрач.MiddleName;
			КонецЕсли;
			//Контрагент.Код = ЭлементМассивВрач.Code;
			Контрагент.НаименованиеПолное = Контрагент.Наименование;
			Контрагент.КодАгента = ЭлементМассивВрач.Code;
			Контрагент.омг_ВнешнийАгент = Истина;
			Если НЕ Свойства.Получить("Iin") = Неопределено Тогда		
				Контрагент.ИНН = ЭлементМассивВрач.Iin; 
			КонецЕсли;
			Если ЭлементМассивВрач.Removed = "true" Тогда
				Контрагент.ПометкаУдаления = Истина;
			КонецЕсли;
			Контрагент.Записать(); 
			
			ЗагруженоВрачей = ЗагруженоВрачей + 1;
			 
			Если НЕ Свойства.Получить("MobilePhone") = Неопределено И ЗначениеЗаполнено(ЭлементМассивВрач.MobilePhone) Тогда
				ЗаписьКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				ЗаписьКИ.Объект = Контрагент.Ссылка;
				ЗаписьКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				ЗаписьКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				ЗаписьКИ.Значение = ЭлементМассивВрач.MobilePhone;
				ЗаписьКИ.Представление = ЭлементМассивВрач.MobilePhone;
				ЗаписьКИ.Записать();
			КонецЕсли;
			
			Если НЕ Свойства.Получить("HomePhone") = Неопределено И ЗначениеЗаполнено(ЭлементМассивВрач.HomePhone) Тогда
				ЗаписьКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				ЗаписьКИ.Объект = Контрагент.Ссылка;
				ЗаписьКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				ЗаписьКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
				ЗаписьКИ.Значение = ЭлементМассивВрач.HomePhone;
				ЗаписьКИ.Представление = ЭлементМассивВрач.HomePhone;
				ЗаписьКИ.Записать();
			КонецЕсли;
			              
			Если НЕ Свойства.Получить("Email") = Неопределено И ЗначениеЗаполнено(ЭлементМассивВрач.Email) Тогда
				ЗаписьКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				ЗаписьКИ.Объект = Контрагент.Ссылка;
				ЗаписьКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				ЗаписьКИ.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
				ЗаписьКИ.Значение = ЭлементМассивВрач.Email;
				ЗаписьКИ.Представление = ЭлементМассивВрач.Email;
				ЗаписьКИ.Записать();
			КонецЕсли;
			
			Если НЕ Свойства.Получить("Comment") = Неопределено И ЗначениеЗаполнено(ЭлементМассивВрач.Comment) Тогда
				ЗаписьКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				ЗаписьКИ.Объект = Контрагент.Ссылка;
				ЗаписьКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				ЗаписьКИ.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
				ЗаписьКИ.Значение = ЭлементМассивВрач.Comment;
				ЗаписьКИ.Представление = ЭлементМассивВрач.Comment;
				ЗаписьКИ.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		Константы.ПоследнийTimeStampЕИП.Установить(ПоследнийTimeStamp);
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ОтправитьДокументОказаниеУслугВЕИП(Документ, Работы, Врач, ТаблицаПроцентов) Экспорт
	
	#Если СЕРВЕР И НЕ СЕРВЕР Тогда
		Документ = Документы.ОказаниеУслуг.ПустаяСсылка();	
	#КонецЕсли
	
	Услуги = Новый ТаблицаЗначений;
	Услуги.Колонки.Добавить("Name",);
	Услуги.Колонки.Добавить("Code",);
	Услуги.Колонки.Добавить("Count",);
	Услуги.Колонки.Добавить("Price",);
	Услуги.Колонки.Добавить("DoctorMoney",);
	
	//услуги уже должны быть отфильтрованы
	Для Каждого Стр Из Работы Цикл
		ПроцентВрача = ТаблицаПроцентов.Найти(Стр.Номенклатура).Процент; //надо получить процент
		НовСтр = Услуги.Добавить();
		НовСтр.Name = Стр.Номенклатура.НаименованиеПолное;
		НовСтр.Code = Стр.Номенклатура.Артикул;
		НовСтр.Count = Стр.Количество;
		НовСтр.Price = СтрЗаменить(Формат(Стр.Сумма / Стр.Количество,"ЧДЦ=2; ЧРД=.; ЧГ=0"), ".", "");
		НовСтр.DoctorMoney = СтрЗаменить(Формат(Стр.Сумма * ПроцентВрача / 100,"ЧДЦ=2; ЧРД=.; ЧГ=0"), ".", "");
	КонецЦикла;
	
	Параметры = Новый Структура();
	Параметры.Вставить("LastName", Документ.Клиент.Фамилия);
	Параметры.Вставить("FirstName", Документ.Клиент.Имя);
	Параметры.Вставить("MiddleName", Документ.Клиент.Отчество);
	Параметры.Вставить("BirthDate", Документ.Клиент.ДатаРождения);
	Параметры.Вставить("Gender", ?(Документ.Клиент.Пол = Перечисления.ПолФизическихЛиц.Мужской, "1", "2"));
	Параметры.Вставить("PriorityHigh", "true");
	Параметры.Вставить("Comment", "");
	Параметры.Вставить("CreateDate", Документ.Дата);
	Параметры.Вставить("RequestNr", Документ.Номер);    //Номер запроса
	Параметры.Вставить("MisRequestId", XMLСтрока(Документ));  //ID запроса в системе
	Параметры.Вставить("CabinetCode", Документ.Филиал.КодКабинета);     //Код кабинета
	Параметры.Вставить("LabCode", Документ.Филиал.КодЛаборатории);
	Параметры.Вставить("DoctorCode", Врач.КодАгента);
	Параметры.Вставить("Услуги", Услуги);
	
	//Т = ПолучитьТекстЗапросаДляОтправкиНачисленийПоВрачам(Параметры);
	
	// Для отладки
	Возврат;
	
	Ответ = ВызватьСерверЕИП(ПолучитьТекстЗапросаДляОтправкиНачисленийПоВрачам(Параметры));
	Если Ответ = Неопределено Тогда
		Возврат ;
	КонецЕсли;
	
	Если НЕ Ответ.КодСостояния = 200 Тогда
		Возврат ;
	КонецЕсли; 
	
	ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	//читаем xml в переменную
	ОтветXML = Новый ЧтениеXML();
	ОтветXML.УстановитьСтроку(ОтветСтрокой);
	
	//десериализуем текст в объект с помощью фабрики
	Объектxdto = ДесериализоватьОтветЧерезФабрику("ИнтеграцияЕИП_ОтветОтправкаНачислений",ОтветXML);
	
	Если НЕ Объектxdto.MethodResponse.Свойства().Получить("Result") = Неопределено  
		И НЕ Объектxdto.MethodResponse.Result.Свойства().Получить("id") = Неопределено Тогда
		
		//запишем id документа в еип
		об = Документ.ПолучитьОбъект();
		Об.ИдентификаторВЕИП = Объектxdto.MethodResponse.Result.id;
		Об.ОбменДанными.Загрузка = Истина;
		Об.Записать(РежимЗаписиДокумента.Запись);
		
	//ошибки	
	ИначеЕсли НЕ Объектxdto.MethodResponse.Свойства().Получить("Result") = Неопределено
		И НЕ Объектxdto.MethodResponse.Result.Свойства().Получить("Errors") = Неопределено Тогда
		
		//Сообщить(Объектxdto.MethodResponse.Result.Errors.Item.Message);
		ЗаписьЖурналаРегистрации("Отправка начислений по врачам в ЕИП", УровеньЖурналаРегистрации.Ошибка,,Документ,Объектxdto.MethodResponse.Result.Errors.Item.Message,РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		ТекстыОшибокОбновленияСтатусов = омг_ИнтеграцияСЛИС.ПолучитьСписокПропускаемыхОшибок();
		омг_ИнтеграцияСЛИС.ЗафиксироватьОшибочныйДокумент(Документ, Объектxdto.MethodResponse.Result.Errors.Item.Message, ТекстыОшибокОбновленияСтатусов);

	КонецЕсли;
	
КонецПроцедуры

Функция НайтиДокументыОказанияУслугДляОтправкиВЕИП() Экспорт
	
	//запомним проценты
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцентыВознагражденийАгентам_ЕИПСрезПоследних.Номенклатура КАК Номенклатура,
		|	ПроцентыВознагражденийАгентам_ЕИПСрезПоследних.Процент КАК Процент
		|ИЗ
		|	РегистрСведений.ПроцентыВознагражденийАгентам_ЕИП.СрезПоследних(&Дата, ) КАК ПроцентыВознагражденийАгентам_ЕИПСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	ТаблицаПроцентов = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_РезультатыОбменаССервисами.Документ КАК Документ
		|ПОМЕСТИТЬ ВТ_Ошибки
		|ИЗ
		|	РегистрСведений.омг_РезультатыОбменаССервисами КАК омг_РезультатыОбменаССервисами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОказаниеУслугРаботы.Ссылка КАК Ссылка,
		|	ОказаниеУслугРаботы.омг_НаправившийВрач КАК омг_НаправившийВрач
		|ИЗ
		|	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ошибки КАК ВТ_Ошибки
		|		ПО ОказаниеУслугРаботы.Ссылка = ВТ_Ошибки.Документ
		|ГДЕ
		|	ОказаниеУслугРаботы.Ссылка.Дата >= &Дата
		|	И ОказаниеУслугРаботы.Номенклатура В(&Номенклатура)
		|	И ОказаниеУслугРаботы.омг_НаправившийВрач ССЫЛКА Справочник.Контрагенты
		|	И НЕ ОказаниеУслугРаботы.омг_НаправившийВрач.КодАгента ЕСТЬ NULL
		|	И НЕ ОказаниеУслугРаботы.омг_НаправившийВрач.КодАгента = """"
		|	И ОказаниеУслугРаботы.Ссылка.ИдентификаторВЕИП = """"
		|	И ВТ_Ошибки.Документ ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугРаботы.Ссылка,
		|	ОказаниеУслугРаботы.омг_НаправившийВрач";
	
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаПроцентов.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Дата", Дата(2025, 4, 1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МассивДляУдаления = Новый Массив;
		
		Услуги = ВыборкаДетальныеЗаписи.Ссылка.Работы.Выгрузить(Новый Структура("омг_НаправившийВрач", ВыборкаДетальныеЗаписи.омг_НаправившийВрач), );
		
		Для Каждого Стр Из Услуги Цикл
			Если ТаблицаПроцентов.Найти(Стр.Номенклатура, "Номенклатура") = Неопределено Тогда
				МассивДляУдаления.Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Стр Из МассивДляУдаления Цикл
			Услуги.Удалить(Стр);
		КонецЦикла;
		
		ОтправитьДокументОказаниеУслугВЕИП(ВыборкаДетальныеЗаписи.Ссылка, Услуги, ВыборкаДетальныеЗаписи.омг_НаправившийВрач ,ТаблицаПроцентов);
		
	КонецЦикла;
	
КонецФункции

Процедура ВыполнитьОтправкуНачисленийПоОказаннымУслугамВЕИП() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцентыВознагражденийАгентам_ЕИПСрезПоследних.Номенклатура КАК Номенклатура,
		|	ПроцентыВознагражденийАгентам_ЕИПСрезПоследних.Процент КАК Процент
		|ПОМЕСТИТЬ ВТ_ПозицииВознагражденияАгентам
		|ИЗ
		|	РегистрСведений.ПроцентыВознагражденийАгентам_ЕИП.СрезПоследних(&ТекущаяДата, ) КАК ПроцентыВознагражденийАгентам_ЕИПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	омг_РезультатыОбменаССервисами.Документ КАК Документ
		|ПОМЕСТИТЬ ВТ_Ошибки
		|ИЗ
		|	РегистрСведений.омг_РезультатыОбменаССервисами КАК омг_РезультатыОбменаССервисами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОказаниеУслугРаботы.Ссылка КАК Ссылка,
		|	ОказаниеУслугРаботы.омг_НаправившийВрач КАК омг_НаправившийВрач,
		|	ОказаниеУслугРаботы.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
		|	ОказаниеУслугРаботы.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ОказаниеУслугРаботы.Количество КАК Количество,
		|	ОказаниеУслугРаботы.Сумма КАК Сумма,
		|	ОказаниеУслугРаботы.Сумма * ВТ_ПозицииВознагражденияАгентам.Процент / 100 КАК СуммаВознаграждения,
		|	ОказаниеУслугРаботы.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Позиции
		|ИЗ
		|	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ошибки КАК ВТ_Ошибки
		|		ПО ОказаниеУслугРаботы.Ссылка = ВТ_Ошибки.Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПозицииВознагражденияАгентам КАК ВТ_ПозицииВознагражденияАгентам
		|		ПО ОказаниеУслугРаботы.Номенклатура = ВТ_ПозицииВознагражденияАгентам.Номенклатура
		|ГДЕ
		|	ОказаниеУслугРаботы.Ссылка.Дата >= &ДатаНачалаОтправки
		|	И ОказаниеУслугРаботы.омг_НаправившийВрач ССЫЛКА Справочник.Контрагенты
		|	И НЕ ОказаниеУслугРаботы.омг_НаправившийВрач.КодАгента ЕСТЬ NULL
		|	И НЕ ОказаниеУслугРаботы.омг_НаправившийВрач.КодАгента = """"
		|	И ОказаниеУслугРаботы.Ссылка.ИдентификаторВЕИП = """"
		|	И ВТ_Ошибки.Документ ЕСТЬ NULL
		|	И ОказаниеУслугРаботы.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОказаниеУслуг.Ссылка КАК Ссылка,
		|	ОказаниеУслуг.Номер КАК Номер,
		|	ОказаниеУслуг.Дата КАК Дата,
		|	ОказаниеУслуг.Клиент.Фамилия КАК КлиентФамилия,
		|	ОказаниеУслуг.Клиент.Имя КАК КлиентИмя,
		|	ОказаниеУслуг.Клиент.Отчество КАК КлиентОтчество,
		|	ОказаниеУслуг.Клиент.Пол КАК КлиентПол,
		|	ОказаниеУслуг.Клиент.ДатаРождения КАК КлиентДатаРождения,
		|	ОказаниеУслуг.Филиал.КодКабинета КАК ФилиалКодКабинета,
		|	ОказаниеУслуг.Филиал.КодЛаборатории КАК ФилиалКодЛаборатории,
		|	ОказаниеУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту) КАК ЭтоПродажа
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	ВТ_Позиции КАК ВТ_Позиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|		ПО ВТ_Позиции.Ссылка = ОказаниеУслуг.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документы.Ссылка КАК Ссылка,
		|	ВТ_Документы.Номер КАК Номер,
		|	ВТ_Документы.Дата КАК Дата,
		|	ВТ_Документы.КлиентФамилия КАК КлиентФамилия,
		|	ВТ_Документы.КлиентИмя КАК КлиентИмя,
		|	ВТ_Документы.КлиентОтчество КАК КлиентОтчество,
		|	ВТ_Документы.КлиентПол КАК КлиентПол,
		|	ВТ_Документы.КлиентДатаРождения КАК КлиентДатаРождения,
		|	ВТ_Документы.ФилиалКодКабинета КАК ФилиалКодКабинета,
		|	ВТ_Документы.ФилиалКодЛаборатории КАК ФилиалКодЛаборатории,
		|	ВТ_Документы.ЭтоПродажа КАК ЭтоПродажа
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Позиции.Ссылка КАК Ссылка,
		|	ВТ_Позиции.омг_НаправившийВрач КАК омг_НаправившийВрач,
		|	ВЫРАЗИТЬ(ВТ_Позиции.НоменклатураНаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
		|	ВТ_Позиции.НоменклатураАртикул КАК Артикул,
		|	ВТ_Позиции.Сумма / ВТ_Позиции.Количество КАК Цена,
		|	ВТ_Позиции.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВТ_Документы.ЭтоПродажа
		|			ТОГДА ВТ_Позиции.СуммаВознаграждения
		|		ИНАЧЕ -ВТ_Позиции.СуммаВознаграждения
		|	КОНЕЦ КАК СуммаВознаграждения,
		|	ВТ_Позиции.Количество КАК Количество,
		|	ВТ_Позиции.омг_НаправившийВрач.КодАгента КАК КодАгента
		|ИЗ
		|	ВТ_Позиции КАК ВТ_Позиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
		|		ПО ВТ_Позиции.Ссылка = ВТ_Документы.Ссылка
		|ИТОГИ ПО
		|	Ссылка,
		|	омг_НаправившийВрач";
	
	Запрос.УстановитьПараметр("ДатаНачалаОтправки", Дата(2025, 4, 1));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();

	Если ПакетРезультатов.Получить(4).Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДокументов = ПакетРезультатов.Получить(4).Выбрать();
	
	ВыборкаПозицийПоДокументам = ПакетРезультатов.Получить(5).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаПозицийПоДокументам.Сбросить();
		ВыборкаПозицийПоДокументам.НайтиСледующий(ВыборкаДокументов.Ссылка, "Ссылка");
		
		ВыборкаПозицийПоВрачам = ВыборкаПозицийПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПозицийПоВрачам.Следующий() Цикл
			
			ВыборкаПозицийДетали = ВыборкаПозицийПоВрачам.Выбрать();
			
			Услуги = Новый ТаблицаЗначений;
			Услуги.Колонки.Добавить("Name",);
			Услуги.Колонки.Добавить("Code",);
			Услуги.Колонки.Добавить("Count",);
			Услуги.Колонки.Добавить("Price",);
			Услуги.Колонки.Добавить("DoctorMoney",);
			
			//услуги уже должны быть отфильтрованы
			Пока ВыборкаПозицийДетали.Следующий() Цикл
				НовСтр = Услуги.Добавить();
				НовСтр.Name = ВыборкаПозицийДетали.НаименованиеПолное;
				НовСтр.Code = ВыборкаПозицийДетали.Артикул;
				НовСтр.Count = ВыборкаПозицийДетали.Количество;
				НовСтр.Price = СтрЗаменить(Формат(ВыборкаПозицийДетали.Цена,"ЧДЦ=2; ЧРД=.; ЧГ=0"), ".", "");
				НовСтр.DoctorMoney = СтрЗаменить(Формат(ВыборкаПозицийДетали.СуммаВознаграждения,"ЧДЦ=2; ЧРД=.; ЧГ=0"), ".", "");
			КонецЦикла;
			
			Параметры = Новый Структура();
			Параметры.Вставить("LastName", ВыборкаДокументов.КлиентФамилия);
			Параметры.Вставить("FirstName", ВыборкаДокументов.КлиентИмя);
			Параметры.Вставить("MiddleName", ВыборкаДокументов.КлиентОтчество);
			Параметры.Вставить("BirthDate", ВыборкаДокументов.КлиентДатаРождения);
			Параметры.Вставить("Gender", ?(ВыборкаДокументов.КлиентПол = Перечисления.ПолФизическихЛиц.Мужской, "1", "2"));
			Параметры.Вставить("PriorityHigh", "true");
			Параметры.Вставить("Comment", "");
			Параметры.Вставить("CreateDate", ВыборкаДокументов.Дата);
			Параметры.Вставить("RequestNr", ВыборкаДокументов.Номер);    //Номер запроса
			Параметры.Вставить("MisRequestId", XMLСтрока(ВыборкаДокументов.Ссылка));  //ID запроса в системе
			Параметры.Вставить("CabinetCode", ВыборкаДокументов.ФилиалКодКабинета);     //Код кабинета
			Параметры.Вставить("LabCode", ВыборкаДокументов.ФилиалКодЛаборатории);
			Параметры.Вставить("DoctorCode", ВыборкаПозицийПоВрачам.КодАгента);
			Параметры.Вставить("Услуги", Услуги);
			
			//Т = ПолучитьТекстЗапросаДляОтправкиНачисленийПоВрачам(Параметры);
			
			// Для откладки
			//Прервать;
			
			Ответ = ВызватьСерверЕИП(ПолучитьТекстЗапросаДляОтправкиНачисленийПоВрачам(Параметры));
			Если Ответ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ Ответ.КодСостояния = 200 Тогда
				Продолжить;
			КонецЕсли; 
			
			ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку("UTF-8");
			
			//читаем xml в переменную
			ОтветXML = Новый ЧтениеXML();
			ОтветXML.УстановитьСтроку(ОтветСтрокой);
			
			//десериализуем текст в объект с помощью фабрики
			Объектxdto = ДесериализоватьОтветЧерезФабрику("ИнтеграцияЕИП_ОтветОтправкаНачислений",ОтветXML);
			
			Если НЕ Объектxdto.MethodResponse.Свойства().Получить("Result") = Неопределено  
				И НЕ Объектxdto.MethodResponse.Result.Свойства().Получить("id") = Неопределено Тогда
				
				//запишем id документа в еип
				об = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
				Об.ИдентификаторВЕИП = Объектxdto.MethodResponse.Result.id;
				Об.ОбменДанными.Загрузка = Истина;
				Об.Записать(РежимЗаписиДокумента.Запись);
				
				//ошибки	
			ИначеЕсли НЕ Объектxdto.MethodResponse.Свойства().Получить("Result") = Неопределено
				И НЕ Объектxdto.MethodResponse.Result.Свойства().Получить("Errors") = Неопределено Тогда
				
				//Сообщить(Объектxdto.MethodResponse.Result.Errors.Item.Message);
				ЗаписьЖурналаРегистрации("Отправка начислений по врачам в ЕИП", УровеньЖурналаРегистрации.Ошибка,,ВыборкаДокументов.Ссылка,Объектxdto.MethodResponse.Result.Errors.Item.Message,РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
				ТекстыОшибокОбновленияСтатусов = омг_ИнтеграцияСЛИС.ПолучитьСписокПропускаемыхОшибок();
				омг_ИнтеграцияСЛИС.ЗафиксироватьОшибочныйДокумент(ВыборкаДокументов.Ссылка, Объектxdto.MethodResponse.Result.Errors.Item.Message, ТекстыОшибокОбновленияСтатусов);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНакопленияИзРегистра(Клиент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсторияНакопленийПоКартеЕИПСрезПоследних.КартаСкидки.Наименование КАК Карта,
	               |	ИсторияНакопленийПоКартеЕИПСрезПоследних.Сумма КАК Сумма
	               |ИЗ
	               |	РегистрСведений.ИсторияНакопленийПоКартеЕИП.СрезПоследних(, Клиент = &Клиент) КАК ИсторияНакопленийПоКартеЕИПСрезПоследних";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		СуммаНачислений = 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СуммаНачислений = Выборка.Сумма;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СуммаНачислений;
	
КонецФункции

#КонецОбласти

#Область БизнесЛогика

Процедура СделатьЗаписьПоИсторииСкидок(Клиент, ВидСкидки, КартаСкидок, Сумма, Дата) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.ИсторияНакопленийПоКартеЕИП.СоздатьМенеджерЗаписи();
	Запись.Период = Дата;
	Запись.Клиент = Клиент;
	Запись.ВидСкидки = ВидСкидки;
	Запись.КартаСкидки = КартаСкидок;
	Запись.Сумма = Сумма;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновитьДанныеПоКлиентуИзЕИП(Клиент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Клиент) И НЕ ЗначениеЗаполнено(Клиент.ИНН) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНовогоКлиента = ПоискКартыПоИИН(Клиент.ИНН);
	//данные нашлись
	Если СтруктураНовогоКлиента.Свойство("Ошибка") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось соединиться с сервером ЕИП.";
		Сообщение.Сообщить();
	КонецЕсли;
	Если СтруктураНовогоКлиента.ОтветПустой = Ложь И Не СтруктураНовогоКлиента.ЗначениеСкидкиЕИП = Неопределено Тогда
		//ФИО = СтруктураНовогоКлиента.Фамилия + " " + СтруктураНовогоКлиента.Имя + " " + СтруктураНовогоКлиента.Отчество;
		//ИНН = СтруктураНовогоКлиента.ИИН;
		//Телефон = СтруктураНовогоКлиента.Телефон;
		//ВидТелефона = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонСотовый");
		//Адрес = СтруктураНовогоКлиента.Адрес;
		//ДатаРождения = СтруктураНовогоКлиента.ДатаРождения;
		//Пол = ОбщегоНазначения.ОпределитьПол(СтруктураНовогоКлиента.Имя, СтруктураНовогоКлиента.Фамилия, СтруктураНовогоКлиента.Отчество);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КартыСкидок.Ссылка КАК Ссылка,
		               |	Клиентыомг_КартыСкидок.Ссылка ЕСТЬ NULL КАК ДобавитьКарту,
		               |	КартыСкидок.ВидКарты КАК ВидКарты
		               |ИЗ
		               |	Справочник.КартыСкидок КАК КартыСкидок
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты.омг_КартыСкидок КАК Клиентыомг_КартыСкидок
		               |		ПО (Клиентыомг_КартыСкидок.Карта = КартыСкидок.Ссылка)
		               |ГДЕ
		               |	КартыСкидок.Наименование = &НомерКарты
		               |	И КартыСкидок.ВладелецКарты = &ВладелецКарты
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	омг_СоответствиеСкидокВидамКарт.ВидСкидки КАК ВидСкидки,
		               |	омг_СоответствиеСкидокВидамКарт.ВидКарты КАК ВидКарты
		               |ИЗ
		               |	РегистрСведений.омг_СоответствиеСкидокВидамКарт КАК омг_СоответствиеСкидокВидамКарт
		               |ГДЕ
		               |	омг_СоответствиеСкидокВидамКарт.ВидСкидки = &ВидСкидки";
		Запрос.УстановитьПараметр("ВладелецКарты", Клиент);
		Запрос.УстановитьПараметр("ВидСкидки", СтруктураНовогоКлиента.ВидСкидки);
		Запрос.УстановитьПараметр("НомерКарты", СтруктураНовогоКлиента.НомерКарты);
		Запрос.УстановитьПараметр("Скидка", Число(СтруктураНовогоКлиента.ЗначениеСкидкиЕИП) / 100);
		
		ПакетРезультатов = Запрос.ВыполнитьПакет();
		
		КартыРезультатЗапроса = ПакетРезультатов.Получить(0);
		ВидыКартРезультатЗапроса = ПакетРезультатов.Получить(1);
		
		ДобавитьКарту = Истина;
		Если Не КартыРезультатЗапроса.Пустой() Тогда
			ВыборкаКарт = КартыРезультатЗапроса.Выбрать();
			ВыборкаКарт.Следующий();
			КартаСкидок = ВыборкаКарт.Ссылка;
			
			ВыборкаВидыКарт = ВидыКартРезультатЗапроса.Выбрать();
			Если ВыборкаВидыКарт.Следующий() Тогда
				Если Не ВыборкаКарт.ВидКарты = ВыборкаВидыКарт.ВидКарты Тогда
					КартаСкидокОбъект = КартаСкидок.ПолучитьОбъект();
					КартаСкидокОбъект.ВидКарты = ВыборкаВидыКарт.ВидКарты;
					КартаСкидокОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
			
			ДобавитьКарту = ВыборкаКарт.ДобавитьКарту;
		Иначе 
			КартаСкидок = Справочники.КартыСкидок.СоздатьЭлемент();
			КартаСкидок.Наименование = СтруктураНовогоКлиента.НомерКарты;
			КартаСкидок.ВладелецКарты = Клиент;
			ВыборкаВидыКарт = ВидыКартРезультатЗапроса.Выбрать();
			Если ВыборкаВидыКарт.Следующий() Тогда
				КартаСкидок.ВидКарты = ВыборкаВидыКарт.ВидКарты;
			КонецЕсли;
			КартаСкидок.Записать();
			
			КартаСкидок = КартаСкидок.Ссылка;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтруктураНовогоКлиента.ВидСкидки) И Клиент.ВидСкидки <> СтруктураНовогоКлиента.ВидСкидки Или ДобавитьКарту Тогда
			Об = Клиент.ПолучитьОбъект();
			Об.ВидСкидки = СтруктураНовогоКлиента.ВидСкидки;
			//КартаСкидок = ПолучитьКартуСкидкиПоВидуСкидки(Об.ВидСкидки);
			Если ЗначениеЗаполнено(КартаСкидок) Тогда
				Об.омг_КартыСкидок.очистить();
				НоВСтр = Об.омг_КартыСкидок.Добавить();
				НоВСтр.Карта = КартаСкидок;
				НоВСтр.НомерКарты = СтруктураНовогоКлиента.НомерКарты;
			КонецЕсли;
			Об.Записать();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураНовогоКлиента.Сумма) Тогда
			// Старый вариант заполнения
			//СделатьЗаписьПоИсторииСкидок(Клиент, СтруктураНовогоКлиента.ВидСкидки, ПолучитьКартуСкидкиПоВидуСкидки(СтруктураНовогоКлиента.ВидСкидки), СтруктураНовогоКлиента.Сумма, ТекущаяДата()); 
			СделатьЗаписьПоИсторииСкидок(Клиент, СтруктураНовогоКлиента.ВидСкидки, КартаСкидок, СтруктураНовогоКлиента.Сумма, ТекущаяДата()); 
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьКартуСкидкиПоВидуСкидки(ВидСкидки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидСкидки) Тогда
		Возврат Справочники.КартыСкидок.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействиеСкидок.Получатель КАК Получатель
		|ИЗ
		|	РегистрСведений.ДействиеСкидок КАК ДействиеСкидок
		|ГДЕ
		|	ДействиеСкидок.ВидСкидки = &ВидСкидки
		|	И ДействиеСкидок.Получатель ССЫЛКА Справочник.КартыСкидок";
	
	Запрос.УстановитьПараметр("ВидСкидки", ВидСкидки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Получатель;
	КонецЦикла;
	
	Возврат Справочники.КартыСкидок.ПустаяСсылка();
КонецФункции

Процедура ОбновитьДанныеПоКлиентуИзЕИПВФоне(Клиент) Экспорт
	
	//ПараметрыФоновогоЗадания = Новый Массив;
	//	ПараметрыФоновогоЗадания.Добавить(Клиент); 
	//	ФоновыеЗадания.Выполнить("ИнтеграцияЕИП.ОбновитьДанныеПоКлиентуИзЕИП",
	//	ПараметрыФоновогоЗадания, Новый УникальныйИдентификатор, 
	//	"Обновить Данные По Клиенту Из ЕИП");
	ИнтеграцияЕИП.ОбновитьДанныеПоКлиентуИзЕИП(Клиент);
	
КонецПроцедуры 
	
Функция ПолучитьВидСкидкиКлиента(Клиент) Экспорт
	Возврат Клиент.ВидСкидки;	
КонецФункции

Функция ПолучитьКартуСкидкиКлиента(Клиент) Экспорт
	Если Клиент.омг_КартыСкидок.Количество() Тогда
		Возврат Клиент.омг_КартыСкидок[0].Карта;
	Иначе
		Возврат Справочники.КартыСкидок.ПустаяСсылка();
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции

Функция ДесериализоватьОтветЧерезФабрику(МакетXSD, ЧтениеXML)
	
	//заранее сделаем xsd схему из готового xml на сайте
	//https://www.freeformatter.com/xsd-generator.html#before-output
	//потом пихаем в макет xsd 
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ПолучитьОбщийМакет(МакетXSD).ПолучитьТекст());
	
	//++ создаем фабрику из xsd 
	ПостроительDOM = Новый ПостроительDOM;
	Документ = ПостроительDOM.Прочитать(Чтение);
	ПостроительСхем = Новый ПостроительСхемXML;
	Схема = ПостроительСхем.СоздатьСхемуXML(Документ.ЭлементДокумента);	
	НаборСхем = Новый НаборСхемXML;
	НаборСхем.Добавить(Схема);
	Фабрика = Новый ФабрикаXDTO(НаборСхем);
	//-- конец создания фабрики
	
	Возврат Фабрика.ПрочитатьXML(ЧтениеXML);
	
КонецФункции

Функция ВызватьСерверЕИП(ТелоЗапроса, Таймаут = 10)
	
	//SSL = Новый ЗащищенноеСоединениеOpenSSL(); 
	
	SSL = Неопределено;

	//http://testeip.kdlolymp.kz:8888/isys/
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервераЕИП(), 
										  8888, 
										  "", 
										  ""
										  ,,Таймаут,SSL);
										  
 
	АдресРесурса = "/isys/";
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);

	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЗаписьЖурналаРегистрации("Получение данных с ЕИП", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		Возврат Неопределено;
	КонецПопытки;

	Возврат Ответ;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоискаПоИИН(ИИН, КодЛаборатории)
	//пример
	//<Envelope Date="05.06.2019 08:25:09" SessionId="0"> 
	// <MethodCall Name="external-find-card-by-iin"> 
	//  <Params LabCode="99" Iin="780904402563"/> 
	// </MethodCall> 
	//</Envelope>
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Envelope");
	Запись.ЗаписатьАтрибут("Date", Строка(ТекущаяДата()));
	Запись.ЗаписатьАтрибут("SessionId", "0");
	
	Запись.ЗаписатьНачалоЭлемента("MethodCall");
	Запись.ЗаписатьАтрибут("Name","external-find-card-by-iin");
		
	Запись.ЗаписатьНачалоЭлемента("Params");
	Запись.ЗаписатьАтрибут("LabCode",Строка(КодЛаборатории));
	Запись.ЗаписатьАтрибут("Iin", Строка(ИИН));
	Запись.ЗаписатьКонецЭлемента(); //Params 
	
	Запись.ЗаписатьКонецЭлемента(); //MethodCall

	Запись.ЗаписатьКонецЭлемента(); //Envelope
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ПолучитьТекстЗапросаДляЗагрузкиВрачей(TimeStamp)
	//пример
	//<?xml version="1.0" encoding="Windows-1251"?> 
	//<Envelope Date="05.06.2019 08:55:17" SessionId="0"> 
	// <MethodCall Name="external-load-doctors"> 
	//  <Params LastTimestamp="0"/> 
	// </MethodCall> 
	//</Envelope>
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");  //windows-1251
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Envelope");
	Запись.ЗаписатьАтрибут("Date", Строка(ТекущаяДата()));
	Запись.ЗаписатьАтрибут("SessionId", "0");
	
	Запись.ЗаписатьНачалоЭлемента("MethodCall");
	Запись.ЗаписатьАтрибут("Name","external-load-doctors");
		
	Запись.ЗаписатьНачалоЭлемента("Params");
	Запись.ЗаписатьАтрибут("LastTimestamp",Строка(TimeStamp));
	Запись.ЗаписатьКонецЭлемента(); //Params 
	
	Запись.ЗаписатьКонецЭлемента(); //MethodCall

	Запись.ЗаписатьКонецЭлемента(); //Envelope
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ПолучитьТекстЗапросаДляОтправкиНачисленийПоВрачам(Параметры)
	//пример
	//	<?xml version="1.0" encoding="Windows-1251"?> 
	//<Envelope Date="11.07.2017 17:58:35"> 
	// <MethodCall Name="external-request-bill-save"> 
	//  <Params  
	//    FirstName="Иван"  
	//    LastName="Иванов"  
	//    MiddleName="Иванович"  
	//    BirthDate="01.01.2000 00:00:00.000"  
	//    Gender="1"  
	//    PriorityHigh="true"  
	//    Comment=""  
	//    CreateDate="01.09.2019 00:00:00.000"  
	//    RequestNr="Nr1"  
	//    MisRequestId="1"  
	//    CabinetCode="10118"  
	//    LabCode="1"  
	//    DoctorCode="100001"> 
	//   <Services> 
	//    <Item Name="Service1" Code="001"  
	//      Count="1" Price="10000" DoctorMoney="100"/> 
	//    <Item Name="Service2" Code="002"  
	//      Count="1" Price="50000"/> 
	//   </Services> 
	//  </Params> 
	// </MethodCall> 
	//</Envelope>
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Envelope");
	Запись.ЗаписатьАтрибут("Date", Строка(ТекущаяДата()));
		
	Запись.ЗаписатьНачалоЭлемента("MethodCall");
	Запись.ЗаписатьАтрибут("Name","external-request-bill-save");
		
	Запись.ЗаписатьНачалоЭлемента("Params");
	Запись.ЗаписатьАтрибут("FirstName",Параметры.FirstName);
	Запись.ЗаписатьАтрибут("LastName",Параметры.LastName);
	Запись.ЗаписатьАтрибут("MiddleName",Параметры.MiddleName);
	Запись.ЗаписатьАтрибут("BirthDate",Строка(Параметры.BirthDate));
	Запись.ЗаписатьАтрибут("Gender",Параметры.Gender);
	Запись.ЗаписатьАтрибут("PriorityHigh",Параметры.PriorityHigh);
	Запись.ЗаписатьАтрибут("Comment",Параметры.Comment);
	Запись.ЗаписатьАтрибут("CreateDate",Строка(Параметры.CreateDate));
	Запись.ЗаписатьАтрибут("RequestNr",Параметры.RequestNr);
	Запись.ЗаписатьАтрибут("MisRequestId",Параметры.MisRequestId);
	Запись.ЗаписатьАтрибут("CabinetCode",Параметры.CabinetCode);
	Запись.ЗаписатьАтрибут("LabCode",Параметры.LabCode);
	Запись.ЗаписатьАтрибут("DoctorCode",Параметры.DoctorCode);
	
	Запись.ЗаписатьНачалоЭлемента("Services");
	
	Для Каждого Стр ИЗ Параметры.Услуги Цикл
		
		Запись.ЗаписатьНачалоЭлемента("Item");
		Запись.ЗаписатьАтрибут("Name", Стр.Name);
		Запись.ЗаписатьАтрибут("Code", Стр.Code);
		Запись.ЗаписатьАтрибут("Count", Формат(Стр.Count,"ЧДЦ=0; ЧГ=0"));
		Запись.ЗаписатьАтрибут("Price", Стр.Price);
		Запись.ЗаписатьАтрибут("DoctorMoney", Стр.DoctorMoney); 
		Запись.ЗаписатьКонецЭлемента(); //Item
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента(); //Services
	
	Запись.ЗаписатьКонецЭлемента(); //Params 
	
	Запись.ЗаписатьКонецЭлемента(); //MethodCall

	Запись.ЗаписатьКонецЭлемента(); //Envelope
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция АдресСервераЕИП()
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.АдресСервераЕИП.Получить();	
КонецФункции

Функция КодЛаборатории()
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.КодЛабораторииЕИП.Получить();	
КонецФункции

Процедура ИнтеграцияЕИП_ОтправкаНачислений() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ВыполнитьОтправкуНачисленийПоОказаннымУслугамВЕИП();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ПолучитьДанныеДляЗапросовНачисленийНаКарту(МассивДокументов = Неопределено)
	
	Если МассивДокументов = Неопределено Тогда
		МассивДокументов = Новый Массив;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ДокументыНачисленийНаКартыЕИП.Документ КАК Документ
	               |ПОМЕСТИТЬ ВТ_ДокументыНачисленийНаКартыЕИП
	               |ИЗ
	               |	РегистрСведений.омг_ДокументыНачисленийНаКартыЕИП КАК омг_ДокументыНачисленийНаКартыЕИП
	               |ГДЕ
	               |	НЕ омг_ДокументыНачисленийНаКартыЕИП.Документ.КартаКлиента = ЗНАЧЕНИЕ(Справочник.КартыСкидок.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОказаниеУслуг.Ссылка КАК Документ,
	               |	ОказаниеУслуг.СостояниеЧековККМ КАК ЧекПробит,
	               |	ОказаниеУслуг.Филиал.КодКабинета КАК КодКабинета,
	               |	ОказаниеУслуг.Филиал.КодЛаборатории КАК КодЛаборатории,
	               |	ОказаниеУслуг.Филиал.НазваниеОрганизации КАК НазваниеОрганизации,
	               |	ОказаниеУслуг.Номер КАК Номер,
	               |	ОказаниеУслуг.Клиент КАК Клиент,
	               |	ОказаниеУслуг.Клиент.Фамилия КАК КлиентФамилия,
	               |	ОказаниеУслуг.Клиент.Имя КАК КлиентИмя,
	               |	ОказаниеУслуг.Клиент.Отчество КАК КлиентОтчество,
	               |	ОказаниеУслуг.Дата КАК Дата,
	               |	ОказаниеУслуг.Комментарий КАК Комментарий,
	               |	ВЫБОР
	               |		КОГДА ОказаниеУслуг.ВидОперации = &ВидОперацииПродажа
	               |			ТОГДА СуммаПоДокументу.Сумма
	               |		ИНАЧЕ -СуммаПоДокументу.Сумма
	               |	КОНЕЦ КАК СуммаДокумента,
	               |	ВложенныйЗапрос.ВидСкидкиКодЕИП КАК КодЕИП,
	               |	ОказаниеУслуг.КартаКлиента КАК КартаКлиента,
	               |	ОказаниеУслуг.Представление КАК ДокументПредставление,
	               |	ОказаниеУслуг.Клиент.Представление КАК КлиентПредставление,
	               |	ОказаниеУслуг.Проведен КАК Проведен,
	               |	ОказаниеУслуг.Клиент.ИНН КАК КлиентИНН
	               |ПОМЕСТИТЬ ВТ_ДокументыКОтправке
	               |ИЗ
	               |	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ДействиеСкидок.ВидСкидки КАК ВидСкидки,
	               |			ДействиеСкидок.Получатель КАК КартаСкидки,
	               |			ДействиеСкидок.ВидСкидки.КодЕИП КАК ВидСкидкиКодЕИП
	               |		ИЗ
	               |			РегистрСведений.ДействиеСкидок КАК ДействиеСкидок) КАК ВложенныйЗапрос
	               |		ПО ОказаниеУслуг.КартаКлиента.ВидКарты = ВложенныйЗапрос.КартаСкидки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ_ДокументыНачисленийНаКартыЕИП.Документ КАК Документ,
	               |			СУММА(ОказаниеУслугРаботы.Сумма) КАК Сумма
	               |		ИЗ
	               |			ВТ_ДокументыНачисленийНаКартыЕИП КАК ВТ_ДокументыНачисленийНаКартыЕИП
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |				ПО ВТ_ДокументыНачисленийНаКартыЕИП.Документ = ОказаниеУслугРаботы.Ссылка
	               |		ГДЕ
	               |			НЕ ОказаниеУслугРаботы.Номенклатура В ИЕРАРХИИ
	               |						(ВЫБРАТЬ
	               |							омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |						ИЗ
	               |							РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ_ДокументыНачисленийНаКартыЕИП.Документ) КАК СуммаПоДокументу
	               |		ПО ОказаниеУслуг.Ссылка = СуммаПоДокументу.Документ
	               |ГДЕ
	               |	(ОказаниеУслуг.Ссылка В (&МассивДокументов)
	               |			ИЛИ ОказаниеУслуг.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДокументыНачисленийНаКартыЕИП.Документ КАК Документ
	               |				ИЗ
	               |					ВТ_ДокументыНачисленийНаКартыЕИП КАК ВТ_ДокументыНачисленийНаКартыЕИП))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Клиент КАК Клиент,
	               |	ЕСТЬNULL(Клиентыомг_КартыСкидок.НомерКарты, """") КАК НомерКарты,
	               |	Клиентыомг_КартыСкидок.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_КартыСкидок
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		ВТ_ДокументыКОтправке.Клиент КАК Клиент,
	               |		ВТ_ДокументыКОтправке.КартаКлиента КАК КартаКлиента
	               |	ИЗ
	               |		ВТ_ДокументыКОтправке КАК ВТ_ДокументыКОтправке) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты.омг_КартыСкидок КАК Клиентыомг_КартыСкидок
	               |		ПО ВложенныйЗапрос.Клиент = Клиентыомг_КартыСкидок.Ссылка
	               |			И ВложенныйЗапрос.КартаКлиента = Клиентыомг_КартыСкидок.Карта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДокументыКОтправке.Документ КАК Документ,
	               |	ВТ_ДокументыКОтправке.ЧекПробит КАК ЧекПробит,
	               |	ВТ_ДокументыКОтправке.КодКабинета КАК КодКабинета,
	               |	ВТ_ДокументыКОтправке.КодЛаборатории КАК КодЛаборатории,
	               |	ВТ_ДокументыКОтправке.НазваниеОрганизации КАК НазваниеОрганизации,
	               |	ВТ_ДокументыКОтправке.Номер КАК Номер,
	               |	ВТ_ДокументыКОтправке.Клиент КАК Клиент,
	               |	ВТ_ДокументыКОтправке.КлиентФамилия КАК КлиентФамилия,
	               |	ВТ_ДокументыКОтправке.КлиентИмя КАК КлиентИмя,
	               |	ВТ_ДокументыКОтправке.КлиентОтчество КАК КлиентОтчество,
	               |	ВТ_ДокументыКОтправке.Дата КАК Дата,
	               |	ВТ_ДокументыКОтправке.Комментарий КАК Комментарий,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДокументыКОтправке.Проведен
	               |			ТОГДА ВТ_ДокументыКОтправке.СуммаДокумента
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаДокумента,
	               |	ВТ_ДокументыКОтправке.КодЕИП КАК КодЕИП,
	               |	ВТ_ДокументыКОтправке.КартаКлиента КАК КартаКлиента,
	               |	ЕСТЬNULL(ВТ_ДокументыКОтправке.КартаКлиента.Наименование, """") КАК НомерКарты,
	               |	ВТ_ДокументыКОтправке.ДокументПредставление КАК ДокументПредставление,
	               |	ВТ_ДокументыКОтправке.КлиентПредставление КАК КлиентПредставление,
	               |	ВТ_ДокументыКОтправке.КлиентИНН КАК КлиентИНН
	               |ИЗ
	               |	ВТ_ДокументыКОтправке КАК ВТ_ДокументыКОтправке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ_КартыСкидок.Клиент КАК Клиент,
	               |			МАКСИМУМ(ВТ_КартыСкидок.НомерСтроки) КАК НомерСтроки
	               |		ИЗ
	               |			ВТ_КартыСкидок КАК ВТ_КартыСкидок
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ_КартыСкидок.Клиент) КАК ВложенныйЗапрос
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КартыСкидок КАК ВТ_КартыСкидок
	               |			ПО ВложенныйЗапрос.Клиент = ВТ_КартыСкидок.Клиент
	               |				И ВложенныйЗапрос.НомерСтроки = ВТ_КартыСкидок.НомерСтроки
	               |		ПО ВТ_ДокументыКОтправке.Клиент = ВложенныйЗапрос.Клиент";
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("ВидОперацииПродажа", Перечисления.ВидыОперацийОказанияУслуг.ПродажаКлиенту);
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивРезультатов = Новый Массив;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивРезультатов;
	КонецЕсли;
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Запись = Новый ЗаписьXML;
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		Запись.УстановитьСтроку("UTF-8");
		Запись.ЗаписатьТекст("");
		
		Запись.ЗаписатьОбъявлениеXML();
		Запись.ЗаписатьНачалоЭлемента("Envelope");
		Запись.ЗаписатьАтрибут("Date", Строка(ТекущаяДата()));
		Запись.ЗаписатьАтрибут("SessionId", "0");
		
		Запись.ЗаписатьНачалоЭлемента("MethodCall");
		Запись.ЗаписатьАтрибут("Name","external-save-card-request");
		
		Запись.ЗаписатьНачалоЭлемента("Params");
		Запись.ЗаписатьАтрибут("LabCode", ВыборкаДанных.КодЛаборатории);
		Запись.ЗаписатьАтрибут("CabinetCode", ВыборкаДанных.КодКабинета);
		Запись.ЗаписатьАтрибут("HospitalName", ВыборкаДанных.НазваниеОрганизации);
		Запись.ЗаписатьАтрибут("RequestNr", ВыборкаДанных.Номер);
		Запись.ЗаписатьАтрибут("ExternalRequestId", Строка(ВыборкаДанных.Документ.УникальныйИдентификатор()));
		Запись.ЗаписатьАтрибут("LastName", ВыборкаДанных.КлиентФамилия);
		Запись.ЗаписатьАтрибут("FirstName", ВыборкаДанных.КлиентИмя);
		Запись.ЗаписатьАтрибут("MiddleName", ВыборкаДанных.КлиентОтчество);
		Запись.ЗаписатьАтрибут("VisitDate", Формат(ВыборкаДанных.Дата, ""));
		Запись.ЗаписатьАтрибут("Comment", ВыборкаДанных.Комментарий);
		Запись.ЗаписатьАтрибут("TotalMoney", Формат(ВыборкаДанных.СуммаДокумента * 100, "ЧГ="));
		Если ЗначениеЗаполнено(ВыборкаДанных.НомерКарты) Тогда
			Запись.ЗаписатьАтрибут("DiscountCode", Формат(ВыборкаДанных.КодЕИП, "ЧГ="));
			Запись.ЗаписатьАтрибут("CardBarcode", ВыборкаДанных.НомерКарты);
		Иначе
			СведенияОКарте = ПоискКартыПоИИН(ВыборкаДанных.КлиентИНН);
			Запись.ЗаписатьАтрибут("CardBarcode", СведенияОКарте.НомерКарты);
			Запись.ЗаписатьАтрибут("DiscountCode", Формат(СведенияОКарте.КодСкидкиЕИП, "ЧГ="));
			КлиентОбъект = ВыборкаДанных.Клиент.ПолучитьОбъект();
			Если Не КлиентОбъект.омг_КартыСкидок.Количество() = 0 Тогда
				КлиентОбъект.омг_КартыСкидок[0].НомерКарты = СведенияОКарте.НомерКарты;
				КлиентОбъект.ОбменДанными.Загрузка = Истина;
				КлиентОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		
		Запись.ЗаписатьКонецЭлемента(); //Params 
		
		Запись.ЗаписатьКонецЭлемента(); //MethodCall
		
		Запись.ЗаписатьКонецЭлемента(); //Envelope
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Документ", ВыборкаДанных.Документ);
		СтруктураДанных.Вставить("ДокументПредставление", ВыборкаДанных.ДокументПредставление);
		СтруктураДанных.Вставить("КлиентПредставление", ВыборкаДанных.КлиентПредставление);
		СтруктураДанных.Вставить("ТекстЗапроса", Запись.Закрыть());
		
		МассивРезультатов.Добавить(СтруктураДанных);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивРезультатов;
	
КонецФункции

Процедура ИнтеграцияЕИП_ОтправкаНачисленийНаКартыКлиентов() Экспорт

	МассивТекстовЗапросов = ПолучитьДанныеДляЗапросовНачисленийНаКарту();
	
	ЗаписьЖурналаРегистрации("Интеграция с ЕИП: Подготовка начислений на карту", 
		УровеньЖурналаРегистрации.Информация,, , 
		"Всего подготовлено: " + МассивТекстовЗапросов.Количество(), РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		
	УспешноОтправлено = 0;	
	
	Для Каждого ДанныеОтправки Из МассивТекстовЗапросов Цикл
		
		Ответ = ВызватьСерверЕИП(ДанныеОтправки.ТекстЗапроса);
		
		Если Ответ = Неопределено Или НЕ Ответ.КодСостояния = 200 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку("UTF-8");
		
		//читаем xml в переменную
		ОтветXML = Новый ЧтениеXML();
		ОтветXML.УстановитьСтроку(ОтветСтрокой);
		
		//десериализуем текст в объект с помощью фабрики
		Объектxdto = ДесериализоватьОтветЧерезФабрику("ИнтеграцияЕИП_ОтветОтправкаНачисленийКлиенту",ОтветXML);
		
		ТекстОшибки = "";
		
		Если Не Объектxdto.Свойства().Получить("error") = Неопределено Тогда
			ТекстОшибки = "Документ """ + ДанныеОтправки.ДокументПредставление + """, ошибка: " + Объектxdto.Error.description;
			ЗаписьЖурналаРегистрации("Интеграция с ЕИП: Отправка начислений на карту", 
				УровеньЖурналаРегистрации.Ошибка,, "Ошибка получения данных", ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		КонецЕсли;
		
		Свойства = Объектxdto.MethodResponse.Свойства();
		
		Если Не Объектxdto.MethodResponse.Result.Errors.Свойства().Получить("item") = Неопределено Тогда
			ТекстОшибки = "Документ """ + ДанныеОтправки.ДокументПредставление + """, ошибка: " + Объектxdto.MethodResponse.Result.Errors.item.Message;
			ЗаписьЖурналаРегистрации("Интеграция с ЕИП: Отправка начислений на карту", 
				УровеньЖурналаРегистрации.Ошибка,, "Ошибка получения даннных", ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		КонецЕсли;
			
		Если Не ТекстОшибки = "" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Интеграция с ЕИП: Отправка начислений на карту", 
			УровеньЖурналаРегистрации.Информация,, "Успешеная отправка начислений на карту клиента", 
			"Документ """ + ДанныеОтправки.ДокументПредставление + """, клиент """ + ДанныеОтправки.КлиентПредставление, РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		
		Запись = РегистрыСведений.омг_ДокументыНачисленийНаКартыЕИП.СоздатьМенеджерЗаписи();
		Запись.Документ = ДанныеОтправки.Документ;
		Запись.Удалить();
		
		УспешноОтправлено = УспешноОтправлено + 1;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Интеграция с ЕИП: Завершение отправки начислений на карты", 
		УровеньЖурналаРегистрации.Информация,, "", 
		"Всего отправлено успешно: " + УспешноОтправлено + " из " + МассивТекстовЗапросов.Количество(), РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		
КонецПроцедуры

#КонецОбласти
